 #+TITLE: babel
#+SETUP_FILE: ~/shed/src/meta/ox.setup
#+PROPERTY: header-args :eval never-export
** org-task-tbl
#+name: org-task-tbl
#+begin_src emacs-lisp
  (let* ((ast (org-element-parse-buffer)) ;; built up the abstract syntax tree of the org buffer
         item-types ; all occuring item types. It could be that some task has more item types than another.
         tasks ; accumulation list for the tasks
         current-task ; name of the current task (header of level 1)
         task-items) ; items of the current task
    (org-element-map ast 'headline
      (lambda (hl)
        (cl-case (org-element-property :level hl)
          (1 ; We assume here that headers of level 1 are tasks.
           (when current-task ; registering the old task
             (setq tasks (cons (cons current-task (nreverse task-items)) tasks)))
           (setq current-task (org-element-property :raw-value hl) ; preparing the new task
                 task-items nil))
          (2 ; item
           (let ((item-type (org-element-property :raw-value hl)))
             (setq item-types (cons item-type item-types))
             (setq task-items (cons (cons item-type (org-element-property :todo-keyword hl))
                                    task-items)))))))
    (setq tasks (nreverse (cons (cons current-task (nreverse task-items)) tasks)) ;add the last task
          item-types (sort (cl-remove-duplicates (nreverse item-types) :test 'string-equal) ; list of unique item types
                           #'string<)) ;;Sorting the items lexicographical. Other criteria could be applied.
      ;;;;;;;;;;
    ;; generating the output table:
    (apply
     #'list
     (cons "Item" (mapcar #'car tasks)) ; header
     'hline
     ;; rows:
     (mapcar
      ;; mapping the items to the todo states associated to the tasks:
      (lambda (item-type)
        (cons item-type
              (mapcar
               (lambda (task)
                 (let ((todo-status (cdr (assoc-string item-type task))))
                   todo-status))
               tasks)))
      item-types)))
#+end_src

#+RESULTS: org-task-tbl
| Item               | snippet | skeleton | script |
|--------------------+---------+----------+--------|
| cargo-update-dir   | nil     | nil      | nil    |
| colsum-if          | nil     | nil      | nil    |
| cp-f               | nil     | nil      | nil    |
| dot-version        | nil     | nil      | nil    |
| env-table          | nil     | nil      | nil    |
| extract            | nil     | nil      | nil    |
| gen-dot-tree       | nil     | nil      | nil    |
| get-emacs-version  | nil     | nil      | nil    |
| get-env            | nil     | nil      | nil    |
| git-clone          | nil     | nil      | nil    |
| hg-clone           | nil     | nil      | nil    |
| hg-log-age         | nil     | nil      | nil    |
| hg-rev             | nil     | nil      | nil    |
| hg-summary         | nil     | nil      | nil    |
| http-server        | nil     | nil      | nil    |
| js-copy-link-id    | nil     | nil      | nil    |
| lab                | nil     | nil      | nil    |
| load-file          | nil     | nil      | nil    |
| make-demon         | nil     | nil      | nil    |
| make-dot-tree      | nil     | nil      | nil    |
| make-header        | nil     | nil      | nil    |
| make-list          | nil     | nil      | nil    |
| meta               | nil     | nil      | nil    |
| org-capture-stdout | nil     | nil      | nil    |
| org-headlines-map  | nil     | nil      | nil    |
| org-task-tbl       | nil     | nil      | nil    |
| os                 | nil     | nil      | nil    |
| python             | nil     | nil      | nil    |
| rand               | nil     | nil      | nil    |
| rust               | nil     | nil      | nil    |
| rust-target-triple | nil     | nil      | nil    |
| sh-ob-tangle       | nil     | nil      | nil    |
| shc-weather        | nil     | nil      | nil    |
| sys                | nil     | nil      | nil    |
| term-check         | nil     | nil      | nil    |
| tokei-json         | nil     | nil      | nil    |
| virt               | nil     | nil      | nil    |
| wc-dir-lines       | nil     | nil      | nil    |
| wc-dir-words       | nil     | nil      | nil    |
| wg-keygen          | nil     | nil      | nil    |
| ytdl               | nil     | nil      | nil    |

** org-headlines-map
#+name: org-headlines-map
#+begin_src elisp
  (org-element-map (org-element-parse-buffer 'headline )
      'headline
    (lambda(hl)
      (let ((parent (org-element-property :parent hl )))
        (and (eq (org-element-type parent) 'headline)
             (list (org-element-property :title parent) (org-element-property :title hl))))))

#+end_src

#+RESULTS: org-headlines-map
| sn                 | rs                 |
| rs                 | rust_target_triple |
| rust_target_triple | util               |
| rust_target_triple | demon              |
| sn                 | mk                 |
| mk                 | mk_header          |
| sn                 | js                 |
| js                 | copy-link-id       |
| sn                 | sh                 |
| sh                 | extract            |
| sh                 | git-clone          |
| sh                 | hg-clone           |
| sh                 | hg-rev             |
| sh                 | hg-summary         |
| sh                 | shc-weather        |
| sh                 | sh-ob-tangle       |
| sn                 | elisp              |
| elisp              | org-headlines-map  |
| elisp              | get-emacs-version  |
| elisp              | colsum-if          |
| elisp              | load-file          |
| elisp              | cp-f               |
| sn                 | py                 |
| sn                 | C                  |
| sn                 | dot                |
| dot                | dot-version        |
| dot                | make-dot-tree      |
| dot                | gen-dot-tree       |
| skel               | rust               |
| rust               | bin                |
| bin                | Cargo.toml         |
| bin                | rustfmt.toml       |
| bin                | src/main.rs        |
| rust               | lib                |
| lib                | Cargo.toml         |
| lib                | src/lib.rs         |
| rust               | mod-bin            |
| mod-bin            | Cargo.toml         |
| mod-bin            | main.rs            |
| rust               | mod-lib            |
| mod-lib            | Cargo.toml         |
| mod-lib            | lib.rs             |
| rust               | app                |
| app                | Cargo.toml         |
| app                | src/main.rs        |
| skel               | lab                |
| lab                | rust-fu            |
| lab                | sh-fu              |
| lab                | windows-10-vm      |
| lab                | archlinux-vm       |
| skel               | python             |
| sc                 | sh                 |
| sh                 | ytdl               |
| sh                 | cargo-update-dir   |
| sh                 | wg-keygen          |
| sh                 | rand               |
| sh                 | term-check         |
| sh                 | virt               |
| virt               | qemu               |
| sh                 | sys                |
| sys                | systemd            |
| sys                | inotify            |
| sh                 | os                 |
| os                 | macos              |
| sc                 | py                 |
| py                 | http-server        |

** dot-version
#+begin_src sh
dot -V 2>&1
#+end_src

#+RESULTS:
: dot - graphviz version 2.49.2 (0)

** make-dot-tree
#+name: make-dot-tree
#+begin_src emacs-lisp :var table=org-headlines-map :results output
  (mapcar #'(lambda (x)
		(princ (format "\"%s\" -> \"%s\";\n" (cl-first x) (cl-second x))))
	  table)
#+end_src

#+RESULTS: make-dot-tree
#+begin_example
"sn" -> "rs";
"rs" -> "rust_target_triple";
"rust_target_triple" -> "util";
"rust_target_triple" -> "demon";
"rs" -> "macro";
"sn" -> "mk";
"mk" -> "mk_header";
"sn" -> "js";
"js" -> "copy-link-id";
"sn" -> "sh";
"sh" -> "extract";
"sn" -> "org";
"sn" -> "elisp";
"elisp" -> "get-emacs-version";
"elisp" -> "colsum-if";
"elisp" -> "org-headlines-map";
"sn" -> "py";
"sn" -> "c";
"sn" -> "cpp";
"sn" -> "dot";
"dot" -> "dot-version";
"dot" -> "make-dot-tree";
"dot" -> "gen-dot-tree";
"tm" -> "rust";
"rust" -> "bin";
"bin" -> "Cargo.toml";
"bin" -> "rustfmt.toml";
"bin" -> "src/main.rs";
"rust" -> "lib";
"lib" -> "Cargo.toml";
"lib" -> "src/lib.rs";
"rust" -> "mod-bin";
"mod-bin" -> "Cargo.toml";
"mod-bin" -> "main.rs";
"rust" -> "mod-lib";
"mod-lib" -> "Cargo.toml";
"mod-lib" -> "lib.rs";
"rust" -> "app";
"app" -> "Cargo.toml";
"app" -> "src/main.rs";
"tm" -> "org";
"org" -> "babel";
"tm" -> "python";
"sc" -> "sh";
"sh" -> "app";
"sh" -> "dev";
"dev" -> "cargo";
"sh" -> "crypto";
"sh" -> "rand";
"sh" -> "term";
"sh" -> "virt";
"virt" -> "qemu";
"sh" -> "sys";
"sys" -> "systemd";
"sys" -> "inotify";
"sh" -> "os";
"os" -> "macos";
"sc" -> "py";
"py" -> "net";
#+end_example

